Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ཀུན་ལ་ཡང་། །སྲིད་པ་ཀུན་ལས་རྣམ་གྲོལ་ཡིད་ལྡན་པ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་ལྔ་ལྔ་ཡོད། །
en: “There will be sixty consecutive congregations, Each of them gathering six hundred fifty million Whose minds are liberated from existence.

source: སེམས་ཅན་སྙིང་པོ་བཀྲ་ཤིས་ལྡན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་གསལ་ཞེས་བྱ། །
en: “The heart of sentient beings, Maṅgalin, Will be born in a place called Radiant Splendor.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཁྲི་ཡོད་ཡབ་ནི་ལྷ་དབང་ཡིན། །སྤྱོད་པ་ཅན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend ten thousand leagues. “Excellent Divinity will be his father, and Endowed with Ethical Conduct will be this victor’s mother.

source: སྲས་པོ་ཡིད་འོང་སྣང་ལྡན་རིམ་གྲོ་པ། །
en: Delightful will be his son and Endowed with Light his attendant.

source: ཆོས་ཀྱི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Dharma Light will be the scholar

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་གསུམ་ཀུན་ལའང་། །སྲིད་པའི་མདུད་པ་ཐམས་ཅད་རྣམ་གྲོལ་བ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་ལྔ་ལྔ་ཡོད། །
en: “There will be ninety-three consecutive congregations, Each of them gathering nine hundred fifty million Who have unraveled all the knots of existence.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བརྒྱད་པ་གཅིག ། གསེར་དང་ནོར་བུའི་ལྡ་ལྡིས་མཛེས་པར་བྱས། །
en: The relics of this victor will reside in a single stūpa Eight leagues large and decorated with tassels of gold and jewels.

source: རྒྱལ་བ་ཡུལ་འཁོར་མྱ་ངན་མེད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མྱ་ངན་སེལ་ཞེས་བྱ། །
en: “The victorious one Aśokarāṣṭra, Will be born in a place called Suffering Dispelled.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་བཅུ་ཡབ་ནི་དུལ་བ་ཡིན། །ཉེས་པ་སྤོང་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend ninety leagues. “Trained will be his father, and Relinquishment of Flaws will be this victor’s mother.

source: སྲས་པོ་ཚལ་འདོར་དྲག་ཤུལ་རིམ་གྲོ་པ། །
en: Discarding the Wilderness will be his son and Fierce his attendant.

source: ཡོན་ཏན་མིག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Eye of Qualities will be the scholar

source: གྲགས་པ་རྣམ་པར་སྤྲུལ་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Famed Emanations the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དུལ་བའི་ཡིད་ལྡན་བསྒོམས་པའི་བདག་ཉིད་ཅན། །བྱེ་བ་ཕྲག་ནི་བརྒྱ་བརྒྱ་འདུས་པར་འགྱུར། །
en: “There will be eighty consecutive congregations, Each of them gathering one billion Meditators whose minds are endowed with training.

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །བརྒྱད་ཅུ་རྩ་གསུམ་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma will also remain For eighty-three thousand years.

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་སེམས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཡིད་ཚིམ་བྱེད་ཅེས་བྱ། །
en: “The thus-gone Maticintin Will be born in a place called Satisfying the Mind.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སྟོང་ཡོད་རྫུ་འཕྲུལ་ལྷ་ནི་ཡབ། །ཡིད་གཉིས་འདོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend one thousand leagues. “Miraculous God will be his father, and Two-Minded Wish will be this victor’s mother.

source: སྲས་པོ་ལྟ་བྱེད་དེས་པ་རིམ་གྲོ་པ། །
en: Eye will be his son and Gentle his attendant.

source: ཤེས་རབ་འཕགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Superior Insight will be the scholar

source: མཆོག་རྒྱལ་བརྟུལ་ཞུགས་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme and Victorious Discipline the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་གཅིག་ཀུན་ལའང་། །བག་ཆགས་ཕ་མཐར་ཕྱིན་པའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty-one consecutive congregations, Each of them gathering eight hundred twenty million Meditators who have reached the end of karmic imprints.

source: མི་ཚེ་ལོ་གྲངས་བརྒྱད་ཁྲི་ལྔ་སྟོང་ཡིན། །
en: The lifespan of humans will be eighty-five thousand years,

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བཅུ་གཉིས་པ། །གཅིག་སྟེ་ནོར་བུ་བཟང་པོའི་དྲ་བས་སྤྲས། །
en: His relics will reside in a single stūpa Twelve leagues large and decorated with nets of fine jewels.

source: དེ་བཞིན་གཤེགས་པ་བློ་དང་ལྡན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཤེས་རབ་གསལ་ཞེས་བྱ། །
en: “The thus-gone Matimat Will be born in a place called Clear Insight.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ཆོས་བཟངས་ཡིན། །ཐར་པའི་བརྟུལ་ཞུགས་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend three leagues. “Excellent Dharma will be his father, and Discipline of Liberation will be this victor’s mother.

source: སྲས་པོ་ཏོག་ལྡན་ལེགས་སེམས་རིམ་གྲོ་པ། །
en: Crest Possessor will be his son and Excellent Attention his attendant.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །སྲིད་པའི་རྒྱ་མཚོའི་ཕ་མཐར་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering eight hundred twenty million Meditators who have reached the end of the ocean of existence.

source: སྣང་བ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this teacher has gone beyond appearances His sacred Dharma will also remain for eighty thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་བཅུ་གསུམ་པ། །རིན་ཆེན་མང་པོའི་དྲ་བས་མཛེས་པར་བྱས། །
en: The stūpa of this victor will measure thirteen leagues And be decorated with nets of numerous jewels.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་སྒྲོན་མ་སྤྱན། །སྐྱེ་བའི་ཡུལ་ནི་ཆོས་ཀྱི་རྒྱལ་མཚན་ཡིན། །རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་བློ་གྲོས་ཅན། །ཟླ་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The thus-gone Dharma­pradīpākṣa Will be born in a place called Dharma Banner. The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Intelligent will be his father, and Supreme Moon will be this victor’s mother.

source: སྲས་པོ་ཟླས་བྱིན་འཇམ་པའི་རིམ་གྲོ་པ། །
en: Moon Gift will be his son and Loving Kindness his attendant.

source: སྤོབས་པ་སེམས་ནི་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Mind of Acumen will be the scholar

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་བཞི་ཀུན་ལའང་། །ང་རྒྱལ་སྲེད་པའི་དྲ་བ་འཇིག་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་ལྔ་ལྔ་ཡོད། །
en: “There will be sixty-four consecutive congregations, Each of them gathering six hundred fifty million Who destroy the net of pride and craving.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དྲུག་ཁྲི་ལྔ་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained parinirvāṇa His sacred Dharma will remain for sixty-five thousand years.

source: ཐུགས་རྗེ་ཅན་གྱི་སྐུ་གདུང་རྒྱས་འགྱུར་ལ། །རིན་ཆེན་བྱེ་བ་དག་གིས་རབ་ཏུ་བརྒྱན། །
en: The relics of this compassionate one will be abundant And adorned with millions of jewels.

source: འཇིག་རྟེན་མགོན་པོ་ཤིན་ཏུ་གཟིགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་སྒྲོན་ཞེས་བྱ། །
en: “The protector of the world, Sudarśana, Will be born in a place called Lamp of Splendor.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་བརྒྱ་ཡབ་ནི་ཞུམ་མེད་ཡིན། །བློ་བརྟན་འཛིན་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend five hundred leagues. “Undaunted will be his father, and Possessor of Steadfast Mind will be this victor’s mother.

source: རྣམ་པར་སྣང་བྱེད་ཅེས་བྱ་མཁས་པ་སྟེ། །
en: Illuminator will be the scholar

source: འཇིག་རྟེན་སྒྲ་ལ་འཇུག་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Engaging with the Languages of the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །དུག་རྩ་བཅད་དང་མཚུངས་པའི་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering six hundred thirty million Worthy ones who have cut through the roots of poison.

source: མི་ཚེ་ལོ་གྲངས་དྲུག་ཁྲི་སུམ་སྟོང་ཡིན། །
en: The lifespan of humans will be sixty-three thousand years,

source: རྒྱལ་བ་མྱ་ངན་འདས་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དྲུག་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: “And when this victor has attained parinirvāṇa His sacred Dharma will remain for sixty-six thousand years.

source: འཇིག་རྟེན་ཕན་ཕྱིར་རྒྱལ་བའི་སྐུ་གདུང་དག །རྒྱས་འགྱུར་ཁམས་གསུམ་དག་ཏུ་གང་བར་འགྱུར། །
en: For the benefit of the world, the relics of this victor Will be abundant, filling the three realms.

source: དེ་བཞིན་གཤེགས་པ་ཤུགས་ཀྱིས་འདོར་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བ་གསལ་ཞེས་བྱ། །
en: “The thus-gone Vegajaha Will be born in a place called Clear Joy.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ལེགས་བྱིན་ཡིན། །མཆོག་སྦྱིན་འཇུག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend ten leagues. “Excellent Gift will be his father, and Engaging in Supreme Generosity will be this victor’s mother.

source: སྲས་པོ་ཟླ་ལྡན་ཟླས་བྱིན་རིམ་གྲོ་པ། །
en: Moon Possessor will be his son and Moon Gift his attendant.

source: རྡོ་རྗེའི་འགྲོས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Vajra Mode will be the scholar

source: འབྱོར་པ་གསལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Clear Wealth the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །དྲི་མེད་ཚུལ་འཆོས་མེད་པའི་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering seven hundred forty million Stainless worthy ones free from pretense.

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this victor has attained nirvāṇa His sacred Dharma will remain for seventy thousand years.

source: འགྲོ་ལ་ཕན་ཕྱིར་བྱམས་ལྡན་རྒྱལ་བ་ཡི། །སྐུ་གདུང་རྒྱས་འགྱུར་རྣམ་པར་གང་བར་འགྱུར། །
en: For the benefit of wandering beings, the relics of this loving victor Will be abundant, filling the realms.

source: དེ་བཞིན་གཤེགས་པ་སྟོབས་ཅན་སྐྱེ་བ་ཡི། །ཡུལ་ནི་གདུལ་བར་དཀའ་བ་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Atibala Will be born in a place called Hard to Tame.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་ཅུ་ཡབ་ནི་ཞུམ་མེད་ཡིན། །བསོད་ནམས་ཅན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend thirty leagues. “Undaunted will be his father, and Endowed with Merit will be this victor’s mother.

source: སྲས་པོ་སྐྲུན་བྱེད་གཉི་ག་རིམ་གྲོ་པ། །
en: Producer will be his son and Both his attendant.

source: ནོར་བུ་རྐང་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Jewel Supports will be the scholar

source: གསེར་སྒྲོན་ཞེས་བྱ་བ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Golden Lamp the one of miracles.

source: དེ་ན་འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་སྟེ། །ཐམས་ཅད་དག་ལ་བྱེ་བ་དག་ནི་ཕྲག །དགུ་བཅུ་རྩ་ནི་བཞི་བཞི་ཚང་བར་འགྱུར། །
en: “There will be sixty consecutive congregations, Each of them containing a full gathering Of nine hundred forty million.

source: མི་ཚེ་ལོ་གྲངས་བརྒྱད་ཁྲི་བརྒྱད་སྟོང་ཡིན། །
en: The lifespan of humans will be eighty-eight thousand years,

source: འཁྲུགས་པ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one gone beyond strife Will remain for ninety-two thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་རངས་པ་གཅིག །ནོར་བུའི་གདུགས་དང་བཀོད་པ་བླ་རེར་ལྡན། །
en: His relics will reside in a single stūpa measuring one league, Adorned with jewel parasols and decorative canopies.

source: དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་མེ་ཏོག་གི། །སྐྱེ་བའི་ཡུལ་ནི་མཁས་པ་གསལ་ཞེས་བྱ། །
en: “The thus-gone Prajñāpuṣpa Will be born in a place called Clear Expertise.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་སྟོང་ཡབ་ནི་དབེན་མེད་ཡིན། །འབྲུག་སྒྲ་ཞེས་ནི་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend three thousand leagues. “Free from Disagreements will be his father, and Sound of Thunder will be this victor’s mother.

source: སྲས་པོ་སྒོམ་བྱེད་དུལ་བ་རིམ་གྲོ་པ། །
en: Meditator will be his son and Trained his attendant.

source: ཡོན་ཏན་འོད་བཟངས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Excellent Light of Qualities will be the scholar

source: ལྷ་ཡི་གཞལ་མེད་མཚུངས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Equal to a Divine Palace the one of miracles.

source: འདུས་པ་ལན་གྲངས་ལྔ་བཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་བདུད་རྣམས་འཇོམས་པར་བྱེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ལྔ་བཅུ་ལྔ་ལྔ་ཡོད། །
en: “There will be fifty consecutive congregations, Each of them gathering five hundred fifty million Worthy ones who conquer the māras.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བཞི་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this victor has attained parinirvāṇa His sacred Dharma will remain for forty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བཟང་པོས་སྟོང་གསུམ་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, And fine stūpas will fill the three realms.

source: དེ་བཞིན་གཤེགས་པ་བརྟན་པའི་དབྱངས་སྐྱེ་བའི། །ཡུལ་ནི་དྲག་ཤུལ་སྒྲ་དག་འབྱུང་ཞེས་བྱ། །
en: “The thus-gone Dṛḍhasvara Will be born in a place called Source of Fierce Sounds.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་སྟོང་ཡབ་ནི་གནས་པ་མཆོག །གསེར་གྱི་མདོག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend nine leagues. “Supreme Abiding will be his father, and Golden Hue will be this victor’s mother.

source: འཇིག་རྟེན་ལམ་སྲས་སྒྲོན་མ་རིམ་གྲོ་པ། །
en: Path of the World will be his son and Lamp his attendant.

source: ཡོན་ཏན་མཆོག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Supreme Qualities will be the scholar

source: ཀུ་མུ་ད་ཡི་སྙིང་པོ་རྫུ་འཕྲུལ་ཅན། །
en: And Kumuda Essence the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །བག་ཆགས་རྩ་ནས་བཏོན་པའི་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་བརྒྱད་བརྒྱད་ཡོད། །
en: “There will be sixty-two consecutive congregations, Each of them gathering six hundred eighty million Worthy ones who have uprooted karmic imprints.

source: སེམས་ཅན་སྙིང་པོ་བདེ་དང་ལྡན་པ་ཡི། །སྐྱེ་ཡུལ་གཟི་བརྗིད་ཡིད་དུ་འཐད་ཅེས་བྱ། །
en: “The heart of sentient beings, Sukhita, Will be born in a place called Compelling Splendor.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་དགུ་ལྗོན་པའི་དབང་པོ་ཡབ། །མེ་ཏོག་སྒྲོན་མ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend ninety-nine leagues. “King of Trees will be his father, and Flower Lamp will be this victor’s mother.

source: སྲས་པོ་ཙམ་ཀ་མཆོག་མ་རིམ་གྲོ་པ། །
en: Campaka will be his son and Supreme his attendant.

source: བརྟུལ་ཞུགས་ལྷ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Divine Yogic Discipline will be the scholar

source: བཀོད་པ་མི་འཁྲུགས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Immutable Array the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་རྩ་ལྔ་ལ། །དགྲ་བཅོམ་ཐམས་ཅད་ཐ་བ་སྤངས་པ་པོ། །ས་དག་དང་ནི་མཚུངས་པ་ཤ་སྟག་གོ། །
en: “There will be eighty-five consecutive congregations Of worthy ones who have relinquished rigidity And who all resemble the ground.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་བཅུ་གཅིག་པ། །རིན་ཆེན་བརྒྱ་ཡི་དྲ་བས་མཛེས་པར་བྱས། །
en: The stūpa of this victor will measure eleven leagues And be decorated with nets of hundreds of jewels.

source: དེ་བཞིན་གཤེགས་པ་དོན་དག་གསུང་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྨྲ་བ་གསལ་ཞེས་བྱ། །
en: “The thus-gone Arthavādin Will be born in a place called Clear Teaching.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཉིས་སྟོང་ཡབ་ནི་ཟླ་བཟངས་ཡིན། །སྤྲིན་གྱི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be royal And his light will extend two thousand leagues. “Excellent Moon will be his father, and Radiant Clouds will be this victor’s mother.

source: སྲས་པོ་གློག་ལྡན་སྣང་བ་རིམ་གྲོ་པ། །
en: Endowed with Lightning will be his son and Illumination his attendant.

source: སྣང་བ་བྱེད་ཅེས་བྱ་བ་བློ་ཅན་ཏེ། །
en: Illuminator will be the scholar

source: ཡིད་འོང་གསལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Delightful Radiance the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་ཐེར་འབུམ་ཕྲག །བཅུ་སྟེ་ཐམས་ཅད་ལ་ཡང་བསམ་གཏན་པ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: “There will be ten billion consecutive congregations, Each of them gathering One billion meditators.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་སྙེད་ཁོ་ནར་གནས་པར་འགྱུར། །
en: “And when this victor has attained parinirvāṇa His sacred Dharma will remain for just one thousand years.

source: དེ་བཞིན་གཤེགས་པ་དགྱེས་པ་གསལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བྱེད་མཆོག་ཅེས་བྱ། །
en: “The thus-gone Priyaprasanna Will be born in a place called Supreme Enjoyment.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་འབུམ་ཡོད་མི་འཁྲུགས་པ་ནི་ཡབ། །བདུད་རྩིའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend one hundred thousand leagues. “Immutable will be his father, and Nectar Light will be this victor’s mother.

source: སྲས་པོ་བདུད་རྩི་རྣམ་གྲོལ་རིམ་གྲོ་པ། །
en: Nectar will be his son and Liberated his attendant.

source: གནས་པ་མི་འཁྲུགས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Immutable Abiding the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །ཐམས་ཅད་གནས་ཤེས་པ་ལ་མཁས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་ལྔ་ལྔ་ཡོད། །
en: “There will be thirty-six consecutive congregations, Each of them gathering three hundred fifty million Who are experts regarding the facts of all things.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་དྲུག་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: “And when this victor has attained parinirvāṇa His sacred Dharma will remain for sixty-six thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་གསུམ་པ་གཅིག །རིན་ཆེན་མཆོག་གི་དྲ་བས་མཛེས་པར་བྱས། །
en: The relics of this victor will reside in a single stūpa Three leagues large and decorated with nets of supreme jewels.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ཞལ་སྐྱེ་བའི། །ཡུལ་ནི་སྨྲ་བའི་མཆོད་རྟེན་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Harivaktra Will be born in a place called Stūpa for Teaching.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སྟོང་ཡོད་ཡབ་ནི་གཟི་བརྗིད་བཟང་། །གོས་ལ་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend one thousand leagues. “Excellent Splendor will be his father, and Enjoyer of Garments will be this victor’s mother.

source: སྲས་པོ་ཁ་སྒྱུར་ལེགས་གནས་རིམ་གྲོ་པ། །
en: Leader will be his son and Excellent Abiding his attendant.

source: ཡེ་ཤེས་ཟིལ་གྱིས་གནོན་པ་མཁས་པ་སྟེ། །
en: Overpowering Wisdom will be the scholar

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །གཏི་མུག་མེད་པའི་ཕ་མཐར་ཕྱིན་འཕགས་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བརྒྱད་བརྒྱད་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering seven hundred eighty million Noble ones who have perfected freedom from dullness.

source: འགྲོ་བའི་དོན་དང་ཕན་ཕྱིར་རྒྱལ་བ་ཡི། །སྐུ་གདུང་དག་ནི་རྣམ་པར་རྒྱས་པར་འགྱུར། །
en: For the benefit of wandering beings, The relics of this victor will be abundant.

source: མི་ཡི་འདྲེན་པ་གཙུག་ཕུད་སྐྱེ་བ་ཡི། །ཡུལ་ནི་རིན་ཆེན་བརྩེགས་པ་ཞེས་ཀྱང་བྱ། །
en: “The guide of humanity, Cūḍa, Will be born in a place called Piled Jewels.

source: དེའི་རིགས་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་ཏོག་བཟངས་ཡིན། །སྣང་བ་སྦྱིན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend seventy leagues. “Excellent Crest will be his father, and Light Gift will be this victor’s mother.

source: སྲས་པོ་ལྷ་ལེགས་སྒྲ་གཅན་རིམ་གྲོ་པ། །
en: Excellent Divinity will be his son and Rāhu his attendant.

source: སྤོབས་པ་དྲན་པ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Acumen and Mindfulness will be the one of intelligence

source: རྣམ་པར་སྤྲུལ་པའི་ཏོག་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Emanated Crest the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་དྲུག་ཀུན་ལའང་། །འཇིགས་པ་མེད་པའི་གནས་མཆོག་ཐོབ་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བརྒྱད་ཅུ་བདུན་བདུན་ཡོད། །
en: “There will be eighty-six consecutive congregations, Each of them gathering eight hundred seventy million Who have attained the supreme abode of fearlessness.

source: རྒྱལ་བ་ཐུགས་རྗེ་ཆེན་པོ་མཚུངས་མེད་པའི། །སྐུ་གདུང་དག་ནི་རྣམ་པར་རྒྱས་པར་འགྱུར། །
en: This victor of incomparable great compassion Will leave abundant relics.

source: མི་ཡི་འདྲེན་པ་སྣང་བ་མཛད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་གྲགས་ཞེས་བྱ། །
en: “The guide of humanity, Roca, Will be born in a place called Famed Splendor.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཏུ་མེད་པ་ཡབ་ནི་ལེགས་མཐོང་ཡིན། །བལྟ་བར་འོས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will have immeasurable reach. “Excellent Sight will be his father, and Worthy of Looking will be this victor’s mother.

source: སྲས་པོ་མཐུ་རྩལ་མངར་ཅན་རིམ་གྲོ་པ། །
en: Power will be his son and Endowed with Sweetness his attendant.

source: སྣང་བར་བྱེད་པ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Illuminator will be the one of intelligence

source: ཆགས་མེད་གཏི་མུག་མེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Free from Attachment and Dullness the one of miracles.

source: འདུས་པ་ཐུན་མོང་མ་ཡིན་དཔག་ཏུ་མེད། །
en: “There will be innumerable extraordinary congregations,

source: མི་རྣམས་དག་གི་ཚེ་ཚད་དཔག་ཏུ་མེད། །
en: And the lifespan of humans will be unfathomable.

source: སངས་རྒྱས་དགུ་བརྒྱ་དགུ་བཅུ་རྩ་དགུ་ཡི། །མཛད་པ་ཇི་སྙེད་པ་ཀུན་དེས་མཛད་འགྱུར། །
en: This victor will carry out all the activities Undertaken by all the other nine hundred ninety-nine buddhas.

source: འཇིག་རྟེན་ཕན་ཕྱིར་སེམས་ཅན་སྙིང་པོ་དག །མྱ་ངན་འདས་ནས་དམ་ཆོས་གནས་འགྱུར་བའི། །ལོ་གྲངས་སྟོང་ཕྲག་དག་ནི་མཐའ་ཡང་ཡས། །
en: “After this heart of sentient beings has attained nirvāṇa His sacred Dharma will, for the benefit of the world, Remain for innumerable millennia

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When the Blessed One had spoken these words, the bodhisattva Prāmodyarāja once more addressed him:

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, O Blessed One, excellent.

source: བསྐལ་པ་བཟང་པོ་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གང་དང་གང་དག་ལ་དང་པོར་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། དགེ་བའི་རྩ་བ་གང་དང་གང་དག་གིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་བཀུར་སྟི་བགྱིས་ནསབྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དག་ལུང་བསྟན་དུ་གསོལ།
en: Now please make clear the identity of the blessed buddhas before whom these blessed buddhas of the Good Eon first gave rise to the mind of awakening. Please also state the roots of virtue that allowed them to venerate those buddhas and give rise to the mind of awakening.”

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། །
en: “Prāmodyarāja, listen carefully and keep my words in mind; I shall explain.”

source: བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས་བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་ལྟ་ལེགས་སོ་ཞེས་གསོལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: “Respected Blessed One, so be it,” answered the bodhisattva Prāmodyarāja and he listened accordingly.

source: དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་གིས་ནི། །དེ་བཞིན་གཤེགས་པ་མི་ཡི་ཟླ་དེ་ལ། །གསེར་ལས་བྱས་པའི་གདུགས་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Krakucchanda Offered golden parasols To the thus-gone Moon of Humanity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྟབས་དེ་ལ། །སྣ་མའི་མེ་ཏོག་དག་གི་ཕྲེང་བ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Kanakamuni, when a garland maker, Offered a garland of sumanā flowers To the thus-gone Lion Gait And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་སྲུང་བྲམ་ཟེའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཙམ་པའི་མཆོག་དེ་ལ། །སྐ་རགས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kāśyapa, when the son of a brahmin, Offered a belt To the thus-gone Supreme Campaka And in doing so first gave rise to the mind of awakening.

source: ང་ནི་སྔོན་ཚེ་སྨན་པར་གྱུར་པ་ན། །དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་དེ་ལ། །འཇམས་གང་ཞིག་ནི་དབུལ་བར་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “When in the past I was a doctor I offered a cup of rice gruel To the thus-gone Śākyamuni And in doing so first gave rise to the mind of awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་འཁོར་ལོས་སྒྱུར་བ་ཡི། །རྒྱལ་པོ་རྣམ་པར་སྣང་བྱེད་ཅེས་བྱར་གྱུར་པ་ན། །བདེ་གཤེགས་མཐུ་ཆེན་གདུགས་ཚོད་དག་ལ་སྤྱན་དྲངས་ནས། །དང་པོར་བླ་མེད་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The bodhisattva Maitreya, when the universal monarch named Illuminator, Invited the well-gone Powerful To the midday meal And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེ་དག་གིས་ནི། །དེ་བཞིན་གཤེགས་པ་ང་རོ་སྙན་དེ་ལ། །ཕྱག་དར་ཁྲོད་ཀྱི་ལྷན་པ་ཐལ་མོ་ཙམ། །ཕུལ་ནས་དང་པོར་བྱང་ཆུབ་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Siṃha Offered a refuse rag the size of a palm To the thus-gone Melodious Roar And in doing so first gave rise to the mind of unexcelled awakening.
